3ash.nord-flat
asvetliakov.vscode-neovim
castwide.solargraph
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
emeraldwalk.runonsave
esbenp.prettier-vscode
evondev.indent-rainbow-palettes
formulahendry.code-runner
foxundermoon.shell-format
julianiaquinandi.nvim-ui-modifier
miguelsolorio.fluent-icons
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
oderwat.indent-rainbow
redhat.vscode-yaml
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
shopify.ruby-lsp
sorbet.sorbet-vscode-extension
sumneko.lua
tamasfe.even-better-toml
usernamehw.errorlens
vscode-icons-team.vscode-icons